cskilbeck/volume_knob/ch554_firmware_midi/src/main.c
inline bool queue_full()
{
    return queue_size == KEY_QUEUE_LEN;
}

inline uint8 queue_space()
{
    return KEY_QUEUE_LEN - queue_size;
}

inline bool queue_empty()
{
    return queue_size == 0;
}

// push one onto the queue, check it's got space before calling this

void queue_put(midi_packet k)
{
    queue_buffer[(queue_head + queue_size) & (KEY_QUEUE_LEN - 1)] = k;
    queue_size += 1;
}

// pop next from the queue, check it's not empty before calling this

midi_packet queue_get()
{
    uint8 old_head = queue_head;
    queue_size -= 1;
    queue_head = ++queue_head & (KEY_QUEUE_LEN - 1);
    return queue_buffer[old_head];
}

// pop next into somewhere, check it's not empty before calling this

inline void queue_get_at(midi_packet *dst)
{
    *dst = queue_buffer[queue_head];
    queue_size -= 1;
    queue_head = ++queue_head & (KEY_QUEUE_LEN - 1);
}

//////////////////////////////////////////////////////////////////////
// send the next waiting packet if there is one and the usb is ready

void midi_packet_send_update()
{
    if(!ep2_busy && !queue_empty()) {
        queue_get_at((uint32 *)(Ep2Buffer + MAX_PACKET_SIZE));
        hexdump("send", Ep2Buffer + MAX_PACKET_SIZE, 4);
        UEP2_T_LEN = 4;
        UEP2_CTRL = UEP2_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_ACK;    // Answer ACK
        ep2_busy = 1;
    }
}

//////////////////////////////////////////////////////////////////////

#define MIDI_MANUFACTURER_ID 0x36    // Cheetah Marketing, defunct
#define MIDI_FAMILY_CODE_LOW 0x55
#define MIDI_FAMILY_CODE_HIGH 0x44
#define MIDI_MODEL_NUMBER_LOW 0x33
#define MIDI_MODEL_NUMBER_HIGH 0x22

//////////////////////////////////////////////////////////////////////

uint8 const identity_request_2[] = { 0xF0, 0x7E };
// channel in between, we ignore it
uint8 const identity_request_3[] = { 0x06, 0x01, 0xF7 };

#define IDENTITY_REQUEST_LENGTH (sizeof(identity_request_2) + 1 + sizeof(identity_request_3))

uint8 identity_response[] = {
    0xF0,    // identity response header
    0x7E,    // identity response header
    0x00,    // identity response header
    0x06,    // identity response header
    0x02,    // identity response header
    MIDI_MANUFACTURER_ID,
    MIDI_FAMILY_CODE_LOW,
    MIDI_FAMILY_CODE_HIGH,
    MIDI_MODEL_NUMBER_LOW,
    MIDI_MODEL_NUMBER_HIGH,
    0x00,    // UNIQUE_ID goes in here
    0x00,    // UNIQUE_ID goes in here
    0x00,    // UNIQUE_ID goes in here
    0x00,    // UNIQUE_ID goes in here
    0xF7     // sysex terminator
};

//////////////////////////////////////////////////////////////////////

uint8 *sysex_send_ptr;
uint8 sysex_send_sent = 0;
uint8 sysex_send_remain = 0;

bool sysex_send_update()
{
    uint8 r = sysex_send_remain;
    if(r == 0) {
        return false;
    }

    if(r > 3) {
        r = 3;
    }
    uint8 cmd = mci_sysex_start;
    if(r < 3 || sysex_send_remain <= 3) {
        cmd = mci_sysex_end_1 + r - 1;
    }
    midi_packet packet = 0;
    uint8 *dst = (uint8 *)&packet;
    uint8 *src = sysex_send_ptr;
    *dst++ = cmd;
    for(uint8 i = 0; i < r; ++i) {
        *dst++ = *src++;
    }
    queue_put(packet);
    sysex_send_sent += r;
    sysex_send_ptr += r;
    sysex_send_remain -= r;
    return true;
}

//////////////////////////////////////////////////////////////////////

bool sysex_send(uint8 *data, uint8 length)
{
    if(sysex_send_remain != 0) {
        return false;
    }
    if(length < 4) {
        return false;
    }
    sysex_send_remain = length;
    sysex_send_ptr = data;
    return true;
}

//////////////////////////////////////////////////////////////////////

uint8 sysex_recv_buffer[8];
uint8 sysex_recv_length = 0;
uint8 sysex_recv_packet_offset = 0;

void sysex_parse_add(uint8 length)
{
    if(length > (sizeof(sysex_recv_buffer) - sysex_recv_length)) {
        sysex_recv_length = 0;
    } else {
        memcpy(sysex_recv_buffer + sysex_recv_length, midi_in_buffer + sysex_recv_packet_offset + 1, length);
        sysex_recv_length += length;

        if(sysex_recv_buffer[sysex_recv_length - 1] == 0xF7) {

            hexdump("sysex", sysex_recv_buffer, sysex_recv_length);

            sysex_recv_length = 0;

            if(sysex_recv_buffer[0] == 0xF0 && sysex_recv_buffer[1] == 0x7E && sysex_recv_buffer[3] == 0x06) {

                switch(sysex_recv_buffer[4]) {

                // identity request
                case 0x01:

                    identity_response[2] = sysex_recv_buffer[2];
                    identity_response[10] = (chip_id >> 21) & 0x7f;
                    identity_response[11] = (chip_id >> 14) & 0x7f;
                    identity_response[12] = (chip_id >> 7) & 0x7f;
                    identity_response[13] = (chip_id >> 0) & 0x7f;
                    sysex_send(identity_response, sizeof(identity_response));
                    break;

                // toggle led
                case 0x02:
                    LED_BIT = !LED_BIT;
                    break;
                }
            }
        }
    }
}

//////////////////////////////////////////////////////////////////////

void process_midi_packet_in(uint8 length)
{
    sysex_recv_packet_offset = 0;

    while(sysex_recv_packet_offset < length) {

        uint8 cmd = midi_in_buffer[sysex_recv_packet_offset];

        switch(cmd) {

        case mci_sysex_start:
        case mci_sysex_end_3:
            sysex_parse_add(3);
            break;

        case mci_sysex_end_1:
            sysex_parse_add(1);
            break;
        case mci_sysex_end_2:
            sysex_parse_add(2);
            break;

        default:
            sysex_recv_length = 0;
            sysex_recv_packet_offset = length;
            break;
        }
        sysex_recv_packet_offset += 4;
    }
}

//////////////////////////////////////////////////////////////////////
// rotary encoder reader

uint8 const encoder_valid_bits[16] = { 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0 };

uint8 encoder_state = 0;
uint8 encoder_store = 0;

int8 read_encoder()
{
    uint8 a = 0;
    if(!ROTA_BIT) {
        a |= 1;
    }
    if(!ROTB_BIT) {
        a |= 2;
    }

    encoder_state <<= 2;
    encoder_state |= a;
    encoder_state &= 0xf;

    if(encoder_valid_bits[encoder_state] != 0) {
        encoder_store = (encoder_store << 4) | encoder_state;
        switch(encoder_store) {
        case 0xe8:
            return 1;
        case 0x2b:
            return -1;
        }
    }
    return 0;
}

//////////////////////////////////////////////////////////////////////
// Flash LED before jumping to bootloader

void bootloader_led_flash(int8_t n)
{
    LED_BIT = 0;
    for(int8_t i = 0; i < n; ++i) {
        TF2 = 0;
        TH2 = 0;
        TL2 = 120;
        while(TF2 != 1) {
        }
        LED_BIT ^= 1;
    }
}

//////////////////////////////////////////////////////////////////////
// read bytes from the data flash area

bool read_flash_data(uint8 flash_addr, uint8 num_bytes, uint8 *data)
{
    ROM_ADDR_H = DATA_FLASH_ADDR >> 8;
    flash_addr <<= 1;

